export const MOCK_DATAS = [
  {
    _id: "1",
    image: "HYPHEN-2.jpeg",
    name: "Earbudsx",
    price: "THB 1000",
    description:
      "หูฟัง Earbuds ไร้สาย คุณภาพเสียงระดับ aptX™ Audio ให้คุณดื่มด่ำกับเสียงเพลงได้อย่างเต็มที่ ไร้เสียงรอบข้างรบกวน สัมผัสนุ่มสบาย ไม่เจ็บหู ปรับให้เข้ากับรูปทรงของช่องหูได้อย่างพอเหมาะ กันน้ำ กันเหงื่อ ไม่หลุดง่าย มาพร้อมด้วย 8 รูปแบบคำสั่งงานที่แตกต่างกันโดยไม่ต้องแตะโทรศัพท์ ใช้งานได้สะดวกสบายมากยิ่งขึ้น รองรับการชาร์จรูปแบบไร้สาย",
  },
  {
    _id: "2",
    image: "inCharge 6 Max.png",
    name: "inCharge 6 Max",
    price: "THB 1000",
    description:
      "สายชาร์จยาว 1.5 เมตรที่รวบรวมทั้ง 6 รูปแบบการเชื่อมต่อไว้ในเส้นเดียว ชาร์จได้ทุกอุปกรณ์ของคุณ ไม่ว่าจะเป็นโทรศัพท์ ไอแพด แท็ปเล็ต ตลอดจนอุปกรณ์ไอทีมากมาย พร้อมฟีเจอร์สุดล้ำ แชร์แบตเตอรี่จากเครื่องสู่เครื่องได้และถ่ายโอนข้อมูลจากโทรศัพท์สู่คอมพิวเตอร์อย่างง่ายดาย ดีไซน์ทันสมัย ใช้งานง่าย เส้นเดียวจบครบทุกการเชื่อมต่อ",
  },
  {
    _id: "3",
    image: "inCharge-6.jpeg",
    name: "inCharge 6",
    price: "THB 1000",
    description:
      "สายชาร์จพวงกุญแจที่รวบรวมทั้ง 6 รูปแบบการเชื่อมต่อไว้ในเส้นเดียว ชาร์จได้ทุกอุปกรณ์ของคุณ ไม่ว่าจะเป็นโทรศัพท์ ไอแพด แท็ปเล็ต ตลอดจนอุปกรณ์ไอทีมากมาย พร้อมฟีเจอร์สุดล้ำ แชร์แบตเตอรี่จากเครื่องสู่เครื่องได้และถ่ายโอนข้อมูลจากโทรศัพท์สู่คอมพิวเตอร์อย่างง่ายดาย ดีไซน์ทันสมัย ใช้งานง่าย เส้นเดียวจบครบทุกการเชื่อมต่อ",
  },
  {
    _id: "4",
    image: "inCharge Pro.png",
    name: "inCharge Pro",
    price: "THB 1000",
    description:
      "สายชาร์จพวงกุญแจที่เล็กที่สุดในโลก ผ่านการรับรองมาตรฐาน MFi ใช้งานกับ iPhone ได้อย่างมั่นใจและปลอดภัย มีแทบแม่เหล็กคล้องติดแน่น หมดกังวลว่าสายชาร์จจะหล่นร่วงหายไป พกพาสะดวก สามารถนำไปคล้องกับกุญแจรถยนต์ กุญแจบ้าน หรือกระเป๋าเป้ได้เลย ผลิตสายวัสดุคุณภาพ แข็งแรง ทนทาน อายุการใช้งานยาวนาน",
  },
  {
    _id: "5",
    image: "Magsafe.png",
    name: "Magsafe",
    price: "THB 1000",
    description:
      "แท่นวาง MagSafe® ดีไซน์มินิมอล เรียบง่ายและลงตัวในทุกพื้นที่ ทำมุม 45 องศา สะดวกต่อการหยิบจับสมาร์ทโฟนตัวโปรดของคุณ มีฟีเจอร์ที่โดดเด่น สนับสนุนการใช้งานมากขึ้น ให้คุณเลือกหยิบโทรศัพท์ขึ้นมา เพื่อให้ MagSafe ติดอยู่กับโทรศัพท์ หรือสไลด์โทรศัพท์ออกด้านข้าง เพื่อปล่อย MagSafe ไว้ที่เดิม พร้อมติดตั้งแผ่นรอยกันลื่น ป้องกันรอยขีดข่วน",
  },
  {
    _id: "6",
    image: "Tau.jpeg",
    name: "Tau",
    price: "THB 1000",
    description:
      "แท่นชาร์จไร้สายความเร็วสูงสุด 15W มาตรฐาน Qi เปิดประสบการณ์การชาร์จแบบไร้ที่ติ สามารถใช้งานร่วมกับโทรศัพท์หรืออุปกรณ์ไอทีมากมาย คุณภาพระดับพรีเมียม ผลิตจากวัสดุอะลูมิเนียมทั้งเครื่องแบบไร้รอยต่อ  ประกอบกับกระจกเทมเปอร์ที่ทนต่อการขีดข่วน เปิดประสบการณ์การชาร์จแบบไร้ที่ติ",
  },
];

export function getAllProduct() {
  return MOCK_DATAS;
}
